'''Оператор if'''
number = 23
guess = int(input('Введите целое число: '))   # Переводит строковую переменную input в числовую переменную

if guess == number :
    print ('''Поздравляю, вы угадали,
хотя и не выграли никакого приза!''')   #Здесь заканчивается новый блок
elif guess < number :   #elif обЪединяет 2 выражения if else для упрощения
    print ('Нет, загаданное число немного больше этого.')   #Еще один блок
    #Внутри блока вы можете выполнять все, что угодно...
else :
    print ('Нет, загаданное число немного меньше этого.')
    #Чтобы попасть сюда, guess должно быть больше, чем number

print ('Завершено')
# Это последнее выражение выполняется всегда после выполнения оператора if
